## Plan Result (demo_global)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;tax-tribunals-datacapture&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;tax-tribunals-datacapture&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["tax-tribunals-datacapture"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/tax-tribunals-datacapture"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["tax-tribunals-datacapture"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/taxtribunalsdatacapturedemo"
        name                              = "taxtribunalsdatacapturedemo"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (6 unchanged attributes hidden)

      ~ managed_rule {
            # (2 unchanged attributes hidden)

          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "authenticity_token"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "address_lookup_url"
            }

            # (7 unchanged blocks hidden)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1733,"Program":"tfcmt","SHA1":"","Target":"demo_global","Vars":{}} -->